[
  {
    "path": "python/2021-05-06-monthly-provisional-counts-of-deaths/",
    "title": "Monthly Provisional Counts Of Deaths",
    "description": "In this blog I have used Python packages in the Rstudio and done the EDA as well as Summary Statistics on the cause of the death in the united state of america in the year 2019 and 2020.",
    "author": [
      {
        "name": "Jaykumar patel",
        "url": {}
      }
    ],
    "date": "2021-05-06",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nAnalysis of the Monthly Provisional Death counts\r\nImporting Required Libraries\r\nReading Data\r\nSummary Statistics for Numerical Columns\r\nAllCause\r\nNaturalCause\r\nSepticemia (A40-A41)\r\nMalignant neoplasms (C00-C97)\r\nFor the remaining columns\r\n\r\nSummary Statistics for Categorical Data\r\nRace/Ethnicity\r\nSex\r\nAgeGroup\r\n\r\n\r\nAnalysis of the Monthly Provisional Death counts\r\nIn this analysis we going to look into the cause of death in the United State in the year of 2019 and 2020.\r\nImporting Required Libraries\r\n\r\nimport pandas as pd\r\nimport numpy as np\r\n\r\nReading Data\r\n\r\ndeath = pd.read_csv('Data/causes_of_death.csv', index_col= 0)\r\n\r\n\r\ndeath.head()\r\n   Date.Of.Death.Year  ...  Jurisdiction.of.Occurrence\r\n1                2019  ...               United States\r\n2                2019  ...               United States\r\n3                2019  ...               United States\r\n4                2019  ...               United States\r\n5                2019  ...               United States\r\n\r\n[5 rows x 23 columns]\r\n\r\nSummary Statistics for Numerical Columns\r\nThe describe() function computes a summary of statistics pertaining to the DataFrame columns.\r\nDescribe function gives the mean, std and IQR values.\r\nAllCause\r\n\r\ndeath['AllCause'].describe()\r\ncount     2849.000000\r\nmean      2280.159354\r\nstd       6028.864306\r\nmin         10.000000\r\n25%         86.000000\r\n50%        271.000000\r\n75%       1498.000000\r\nmax      53242.000000\r\nName: AllCause, dtype: float64\r\n\r\nThis column tells us about total number of people died in the month of particular year in the United State of America.\r\nFrom the count row we can find that we have 2849 non null values in our data and remaining rows contain null values.\r\nIn this column we can see that the mean value is 2280.159354 and median (50%) is 271, that means our data is right skewed distributed.\r\nSo the frequency of people died at very large number is not high we can say that there are some outliears which leads to this difference.\r\n\r\nStandard deviation of this column is 6028.864306. It indicates data are more spread out. A high standard deviation means data is not closely bound to the mean value.\r\nData is not containing close Continuous number for the people died in the United State of America. It has very large range.\r\nAs we can see the range is 0-53242 and we have only 2849 data, This is why we have high standard deviation and large difference between mean and median.\r\nNaturalCause\r\n\r\ndeath['NaturalCause'].describe()\r\ncount     2717.000000\r\nmean      2194.944056\r\nstd       5945.745418\r\nmin          0.000000\r\n25%         70.000000\r\n50%        216.000000\r\n75%       1294.000000\r\nmax      52054.000000\r\nName: NaturalCause, dtype: float64\r\n\r\nThis column tells us about total number of people died in the month of particular year in the United State of America due to natural cause.\r\nFrom the count row we can find that we have 2717 non null values in our data and remaining rows contain null values.\r\nIn this column we can see that the mean value is 2194.944056 and median (50%) is 216, that means our data is right skewed distributed.\r\nWe have the closest mean and median to the all cause’s mean and median. It means the both are having the some what similar numbers for observation.\r\n\r\nStandard deviation of this column is 5945.745418. It indicates data are more spread out. A high standard deviation means data is not closely bound to the mean value.\r\nIt has very close stadard deviation as allcause column which also add support to the statement that they have some identical numbers or nearest numbers\r\n\r\nSepticemia (A40-A41)\r\n\r\ndeath['Septicemia..A40.A41.'].describe()\r\ncount    1736.000000\r\nmean       44.580069\r\nstd        88.269978\r\nmin         0.000000\r\n25%         0.000000\r\n50%        10.000000\r\n75%        36.000000\r\nmax       484.000000\r\nName: Septicemia..A40.A41., dtype: float64\r\n\r\nThis column tells us about number of people died in the month of particular year in the United State of America due to Septicemia (A40-A41) disease.\r\nFrom the count row we can find that we have 1736 non null values in our data and remaining rows contain null values.\r\nIn this column we can see that the mean value is 44.580069 and median (50%) is 10, that means our data is right skewed distributed.\r\nAround 44 people die every month from this disease.\r\n\r\nStandard deviation of this column is 88.269978. It has the lowest standard deviation of all.\r\nMalignant neoplasms (C00-C97)\r\n\r\ndeath['Malignant.neoplasms..C00.C97.'].describe()\r\ncount    2249.000000\r\nmean      549.167185\r\nstd      1277.215975\r\nmin         0.000000\r\n25%        20.000000\r\n50%        69.000000\r\n75%       338.000000\r\nmax      6498.000000\r\nName: Malignant.neoplasms..C00.C97., dtype: float64\r\n\r\nThis column tells us about total number of people died in the month of particular year in the United State of America due to Malignant neoplasms.\r\nFrom the count row we can find that we have 2249 non null values in our data and remaining rows contain null values.\r\nIn this column we can see that the mean value is 549.167185 and median (50%) is 69, that means our data is right skewed distributed.\r\nWe can say that around 550 people die every month. As compared to the Septicemia more than 12 times more people died due to this disease.\r\n\r\nStandard deviation of this column is 1277.215975. It indicates data are more spread out. A high standard deviation means data is not closely bound to the mean value.\r\nIt has not as large standard deviation as of allcause column but still it has a high standard deviation which means data is not close to it mean so we can not say that our statement for death for everymonth is accurate.\r\n\r\nFor the remaining columns\r\nWe can see that the every column have the low median value and the high mean value. Which means all the column are right skewed.\r\nWe can say that the data frame is not closely bound to its mean values. Our data have very distinct values and its difference from minmum to maximum values are very high.\r\nThis difference means there are very few deaths have high frequency and number of deaths for months are comparatively smallar than it mean values.\r\nHere, we can not state that the number of people died in the month is equal to the mean value and reason is that, as we can see we have very small median and at the same time we have high mean.\r\nThis means that most of the data is less than the mean value there are some outliers. Those outliers are the reason we are having a large mean value.\r\n\r\nSummary Statistics for Categorical Data\r\nRace/Ethnicity\r\nThis column tells us about total number of people died as per their race in the month of particular year in the United State of America.\r\n\r\nprint(death.groupby(['Race.Ethnicity']).size())\r\nRace.Ethnicity\r\nHispanic                                         500\r\nNon-Hispanic American Indian or Alaska Native    500\r\nNon-Hispanic Asian                               500\r\nNon-Hispanic Black                               500\r\nNon-Hispanic White                               500\r\nOther                                            500\r\ndtype: int64\r\n\r\nOur data have uniform distribution when we consider the races.\r\nIt is good to have uniform distribution it help use to train a model which is not bias.\r\nSex\r\nThis column tells us about total number of people died as per their sex in the month of particular year in the United State of America.\r\n\r\nprint(death.groupby(['Sex']).size())\r\nSex\r\nF         720\r\nFemale    780\r\nM         720\r\nMale      780\r\ndtype: int64\r\n\r\nHere also,\r\n* Our data have uniform distribution when we look for the sex. * Having uniform distribution in the data is help us to see how each category affects\r\nAgeGroup\r\nThis column tells us about total number of people died as per their agegroup in the month of particular year in the United State of America.\r\n\r\nprint (death.groupby(['AgeGroup']).size())\r\nAgeGroup\r\n0-4 years            300\r\n15-24 years          300\r\n25-34 years          300\r\n35-44 years          300\r\n45-54 years          300\r\n5-14 years           300\r\n55-64 years          300\r\n65-74 years          300\r\n75-84 years          300\r\n85 years and over    300\r\ndtype: int64\r\n\r\nSame as above data column it also have uniform distribution so if we want to train our model to predict the cause of the death.\r\nWe can use following columns: * Race/Ethnicity * Sex * AgeGroup\r\n\r\n\r\n\r\n",
    "preview": "python/2021-05-06-monthly-provisional-counts-of-deaths/both.JPEG",
    "last_modified": "2021-05-06T16:22:25+05:30",
    "input_file": {}
  }
]
