[
  {
    "path": "posts/2021-05-04-ames-housing-price-analysis/",
    "title": "Ames Housing price analysis",
    "description": "This blog post includes videos that review some Git and GitHub basics and build on that, showing ways you might work on a project together in RStudio.",
    "author": [
      {
        "name": "Jaykumar A Patel",
        "url": {}
      }
    ],
    "date": "2021-05-04",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nUnivariate analysis\r\nExploring the univariate distribution of the response variable Sale price.\r\nFind outlier(s) in your original response variable\r\n\r\nBivariate analysis\r\nHeat Map to find highly correlated features.\r\nRelation between Sale Price and Above ground living area size\r\nRelation between Sale Price and Size of garage\r\nRelation between Sale Price and Total Basement size\r\nConclusion of EDA\r\n\r\n\r\nUnivariate analysis\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nExploring the univariate distribution of the response variable Sale price.\r\n\r\n\r\n\r\nAs we look at the mean and median, median < mean so we can say that our variable is right skewed. But it is not much skewed so we can consider it as normally distributed because in real world we never get perfectly distributed data.\r\nThe reason behind this skewness can be outliers present in the response variable..\r\nFind outlier(s) in your original response variable\r\n\r\n\r\n\r\nWe have found the we have some outliers present in the data which can be reason for the skewness.\r\nBivariate analysis\r\nTo do the bivariate analysis we need to find the features which are highly correlated to the response variable that is house price.\r\nHeat Map to find highly correlated features.\r\n\r\n\r\n\r\nWe can see top 3 numerical feature that are directly correlated to the response variable.\r\nGr_Liv_Area Above Ground Living Area in sqft\r\nGarage_Area Garage Area in sqft\r\nTotal_Bsmt_SF Total basement Size in sqft\r\nNow, We look at each feature one by one and see if we can improve the relation?\r\nRelation between Sale Price and Above ground living area size\r\n\r\n\r\n\r\nHere, we can say that we have some positive relation between sale price and Above Ground Living Area.\r\nBut we can see there are some outliers in Above Ground Living Area, which leads to the less weak relation.\r\n\r\nThe Correlation coefficient before removing outliers is 0.7067799\r\nThe Correlation coefficient after removing outliers is 0.7084774\r\nRelation between Sale Price and Size of garage\r\n\r\n\r\n\r\nHere, we can say that we have some positive relation between sale price and Size of garage.\r\nBut we can see there are some outliers in total basement size, which leads to the less weak relation.\r\n\r\nThe Correlation coefficient before removing outliers is 0.6401383\r\nThe Correlation coefficient after removing outliers is 0.6422716\r\nRelation between Sale Price and Total Basement size\r\n\r\n\r\n\r\nHere, we can say that we have some positive relation between sale price and total basement size.\r\nBut we can see there are some outliers in total basement size, which leads to the less weak relation.\r\n\r\nThe Correlation coefficient before removing outliers is 0.6325288\r\nThe Correlation coefficient after removing outliers is 0.6632371\r\nConclusion of EDA\r\nAs we have seen so far that our three features have some outliers and by removing them we can get more strong relation which will help to improve performance of the model.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-04-ames-housing-price-analysis/housing.png",
    "last_modified": "2021-05-05T22:30:03+05:30",
    "input_file": {},
    "preview_width": 610,
    "preview_height": 436
  }
]
