[
  {
    "path": "posts/2021-05-04-ames-housing-price-analysis/",
    "title": "Ames Housing price analysis",
    "description": "This blog post includes videos that review some Git and GitHub basics and build on that, showing ways you might work on a project together in RStudio.",
    "author": [
      {
        "name": "Jaykumar A Patel",
        "url": {}
      }
    ],
    "date": "2021-05-04",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nUnivariate analysis\r\nExploring the univariate distribution of the response variable Sale price.\r\nFind outlier(s) in your original response variable\r\n\r\nBivariate analysis\r\nHeat Map to find high corrlated features.\r\nRelation between Sale Price and Total Basement size\r\n\r\n\r\nUnivariate analysis\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nExploring the univariate distribution of the response variable Sale price.\r\n\r\n\r\n\r\nAs we look at the mean and median, median < mean so we can say that our variable is right skewed. But it is not much skewed so we can consider it as normally distributed because in real world we never get perfectly distributed data.\r\nThe reason behind this skewness can be outliers present in the response variable..\r\nFind outlier(s) in your original response variable\r\n\r\n\r\n\r\nWe have found the we have some outliers present in the data which can be reason for the skewness.\r\nBivariate analysis\r\nTo do the bivariate analysis we need to find the features which are highly correlated to the response variable that is house price.\r\nHeat Map to find high corrlated features.\r\n\r\n\r\n\r\nRelation between Sale Price and Total Basement size\r\n\r\n\r\n\r\nHere, we can say that we have some positive relation between sale price and total basement size.\r\nBut we can see there are some outliers in total basement size, which leads to the less weak relation.\r\n\r\nThe Correlation coefficient before removing outliers is 0.6629602\r\nThe Correlation coefficient after removing outliers is 0.6325288\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-04-ames-housing-price-analysis/housing.png",
    "last_modified": "2021-05-05T21:19:23+05:30",
    "input_file": "ames-housing-price-analysis.knit.md",
    "preview_width": 610,
    "preview_height": 436
  }
]
